app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all.order(created_at: :desc)
---
SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."created_at" DESC

  def create
    @tweet = Tweet.new(tweet_params)
    if request.xhr?
      @tweet.save
---
INSERT INTO "tweets" ("message", "created_at", "updated_at") VALUES (?, ?, ?)  [["message", "Hey there!\r\n"], ["created_at", 2017-02-22 02:44:52 UTC], ["updated_at", 2017-02-22 02:44:52 UTC]]